### Pandas
- Series
- DataFrame
- Panel
> It mainly used for data analysis.

In [1]:
import pandas as pd
pd.__version__

'0.24.2'

Series
- from list,dictionary
- from numpy array

In [3]:
import numpy as np
np.array([1,2,3])

array([1, 2, 3])

In [8]:
s1 = pd.Series([1,2,3],index=['A','B','C'])
s1

A    1
B    2
C    3
dtype: int64

In [10]:
print(s1[0],s1['A'])

1 1

In [13]:
print(s1[0:2]) # excluding stop

A    1
B    2
dtype: int64

In [14]:
s1['A':'C'] # including stop values

A    1
B    2
C    3
dtype: int64

In [15]:
s1.index=['i1','i2','i3']# changing of index position

In [16]:
s1

i1    1
i2    2
i3    3
dtype: int64

In [17]:
marks = {'maths':67,'science':80,'engilsh':50}
marks

{'maths': 67, 'science': 80, 'engilsh': 50}

In [18]:
pd.Series(marks)

maths      67
science    80
engilsh    50
dtype: int64

In [26]:
pd.date_range('2019-11-23','2019-11-30',periods=5)

DatetimeIndex(['2019-11-23 00:00:00', '2019-11-24 18:00:00',
               '2019-11-26 12:00:00', '2019-11-28 06:00:00',
               '2019-11-30 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [25]:
res = pd.date_range('2019-11-23',periods=3)# 
pd.Series([32,29,30],res)

2019-11-23    32
2019-11-24    29
2019-11-25    30
Freq: D, dtype: int64

In [28]:
s1.index

Index(['i1', 'i2', 'i3'], dtype='object')

In [29]:
pd.Series(np.arange(10))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

## DataFrame
    - from a dictionary
    - from numpy 2d array

In [31]:
student_marks = {'Name':['narmada','sumana','ramesh'],'rollno':[420,123,678],'maths':[45,90,20],'telugu':[45,67,80]}

In [32]:
student_marks

{'Name': ['narmada', 'sumana', 'ramesh'],
 'rollno': [420, 123, 678],
 'maths': [45, 90, 20],
 'telugu': [45, 67, 80]}

In [33]:
pd.DataFrame(student_marks)

      Name  rollno  maths  telugu
0  narmada     420     45      45
1   sumana     123     90      67
2   ramesh     678     20      80

In [37]:
a2 = np.array([['narmada',45,45],['sumana',90,67]])
a2

array([['narmada', '45', '45'],
       ['sumana', '90', '67']], dtype='<U7')

In [39]:
pd.DataFrame(a2,columns=['Name','maths','telugu'],index=['std1','std2'])

         Name maths telugu
std1  narmada    45     45
std2   sumana    90     67

### pd.read_csv()

In [43]:
pd.read_csv('marks.csv')

  narmada   23  57  35
0  sumana   45  78  90
1  nethra  100  45  78

In [46]:
pd.read_csv('marks.csv',header=None)

         0    1   2   3
0  narmada   23  57  35
1   sumana   45  78  90
2   nethra  100  45  78

In [51]:
pd.read_csv('marks.csv',header=1)

  narmada   23  57  35
0  sumana   45  78  90
1  nethra  100  45  78

In [54]:
df = pd.read_csv('marks.csv')

In [53]:
pd.read_csv('marks.csv',usecols=['Name','Telugu'])

      Name  Telugu
0  narmada      23
1   sumana      45
2   nethra     100

In [55]:
df

      Name  Telugu  Maths  English
0  narmada      23     57       35
1   sumana      45     78       90
2   nethra     100     45       78

In [60]:
df['Name']

0    narmada
1     sumana
2     nethra
Name: Name, dtype: object

In [57]:
df.name

AttributeError: 'DataFrame' object has no attribute 'name'

In [62]:
df[['Name','Telugu']] # pandas dataframe

      Name  Telugu
0  narmada      23
1   sumana      45
2   nethra     100

In [63]:
df.values

array([['narmada', 23, 57, 35],
       ['sumana', 45, 78, 90],
       ['nethra', 100, 45, 78]], dtype=object)

In [64]:
df.dtypes

Name       object
Telugu      int64
Maths       int64
English     int64
dtype: object

In [65]:
df.shape

(3, 4)

In [ ]:
#

### Indexing
- Position based Indexing(iloc)
- Label based Indexing(loc)

In [66]:
df['Name']

0    narmada
1     sumana
2     nethra
Name: Name, dtype: object

In [69]:
df.iloc[2,0:3]

Name      nethra
Telugu       100
Maths         45
Name: 2, dtype: object

In [71]:
df.iloc[1:3,:]

     Name  Telugu  Maths  English
1  sumana      45     78       90
2  nethra     100     45       78

In [72]:
df

      Name  Telugu  Maths  English
0  narmada      23     57       35
1   sumana      45     78       90
2   nethra     100     45       78

In [73]:
df.iloc[1,1]

45

In [77]:
df.iloc[:,2]# all row and second column

0    57
1    78
2    45
Name: Maths, dtype: int64

In [78]:
df

      Name  Telugu  Maths  English
0  narmada      23     57       35
1   sumana      45     78       90
2   nethra     100     45       78

In [79]:
df.loc[0,'Name']

'narmada'

In [82]:
df.loc[0:4,'Name']

0    narmada
1     sumana
2     nethra
Name: Name, dtype: object

In [84]:
df.loc[0:3,'Name':'English']

      Name  Telugu  Maths  English
0  narmada      23     57       35
1   sumana      45     78       90
2   nethra     100     45       78

In [85]:
df.loc[0:3,'English':'Name']

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [86]:
df[['Name','English','Telugu']]

      Name  English  Telugu
0  narmada       35      23
1   sumana       90      45
2   nethra       78     100

In [87]:
df

      Name  Telugu  Maths  English
0  narmada      23     57       35
1   sumana      45     78       90
2   nethra     100     45       78

In [89]:
df1 = df.set_index('Name')
df1

         Telugu  Maths  English
Name
narmada      23     57       35
sumana       45     78       90
nethra      100     45       78

In [92]:
df1.loc['nethra','Maths']

45

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
Name       3 non-null object
Telugu     3 non-null int64
Maths      3 non-null int64
English    3 non-null int64
dtypes: int64(3), object(1)
memory usage: 176.0+ bytes

In [95]:
df

      Name  Telugu  Maths  English
0  narmada      23     57       35
1   sumana      45     78       90
2   nethra     100     45       78

In [99]:
df['Total']=df.sum(axis=1) # to add all the subject mark for each student column wise.

In [101]:
df

      Name  Telugu  Maths  English  Total
0  narmada      23     57       35    115
1   sumana      45     78       90    213
2   nethra     100     45       78    223

In [102]:
df.describe()

           Telugu      Maths    English       Total
count    3.000000   3.000000   3.000000    3.000000
mean    56.000000  60.000000  67.666667  183.666667
std     39.661064  16.703293  28.919428   59.676908
min     23.000000  45.000000  35.000000  115.000000
25%     34.000000  51.000000  56.500000  164.000000
50%     45.000000  57.000000  78.000000  213.000000
75%     72.500000  67.500000  84.000000  218.000000
max    100.000000  78.000000  90.000000  223.000000

In [106]:
df.sum(axis=0)# row wise calculation

Name       narmadasumananethra
Telugu                     168
Maths                      180
English                    203
Total                      551
dtype: object

In [107]:
df.describe(include=object)# It describe the highest values

          Name
count        3
unique       3
top     sumana
freq         1

In [108]:
df.describe(include=np.int64)

           Telugu      Maths    English       Total
count    3.000000   3.000000   3.000000    3.000000
mean    56.000000  60.000000  67.666667  183.666667
std     39.661064  16.703293  28.919428   59.676908
min     23.000000  45.000000  35.000000  115.000000
25%     34.000000  51.000000  56.500000  164.000000
50%     45.000000  57.000000  78.000000  213.000000
75%     72.500000  67.500000  84.000000  218.000000
max    100.000000  78.000000  90.000000  223.000000

In [130]:
sf = pd.read_csv('student.csv',names=['Name','College','Course'])
sf

        Name College            Course
0  'narmada'    IIIT  Machine Learning
1  'krishna'     SVU                 C
2   'nethra'    SRIT            Python
3     'mani'    PVKK      Data Science
4   'ganesh'    IIIT      Data Science

### Check the
- head
- tail
- shape
- columns
- dtypes
- index
- info
- describe

In [113]:
sf.head(1) # first

        Name College            Course
0  'narmada'    IIIT  Machine Learning

In [114]:
sf.tail(1) #last row

        Name College            Course
5  'sandhya'    ALTS  Machine Learning

In [118]:
sf.sample(4) # sample is used to random selection of 3 rows.

        Name College            Course
4   'ganesh'    IIIT      Data Science
0  'narmada'    IIIT  Machine Learning
1  'krishna'     SVU                 C
5  'sandhya'    ALTS  Machine Learning

In [119]:
sf.shape

(6, 3)

In [120]:
sf.columns # to display the column names.

Index(['Name', 'College', 'Course'], dtype='object')

In [123]:
sf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
Name       6 non-null object
College    6 non-null object
Course     6 non-null object
dtypes: object(3)
memory usage: 224.0+ bytes

In [131]:
sf.describe()

            Name College        Course
count          5       5             5
unique         5       4             4
top     'nethra'    IIIT  Data Science
freq           1       2             2

In [132]:
sf.nunique()

Name       5
College    4
Course     4
dtype: int64

In [134]:
df.Name.nunique()

3

In [135]:
df.Name.value_counts()

sumana     1
narmada    1
nethra     1
Name: Name, dtype: int64

## pd.merge

In [142]:
pd.merge(df,sf,on='Name',how='outer')

        Name  Telugu  Maths  English  Total College            Course
0    narmada    23.0   57.0     35.0  115.0     NaN               NaN
1     sumana    45.0   78.0     90.0  213.0     NaN               NaN
2     nethra   100.0   45.0     78.0  223.0     NaN               NaN
3  'narmada'     NaN    NaN      NaN    NaN    IIIT  Machine Learning
4  'krishna'     NaN    NaN      NaN    NaN     SVU                 C
5   'nethra'     NaN    NaN      NaN    NaN    SRIT            Python
6     'mani'     NaN    NaN      NaN    NaN    PVKK      Data Science
7   'ganesh'     NaN    NaN      NaN    NaN    IIIT      Data Science

In [147]:
pd.merge(df,sf,on='Name',how='inner')

Empty DataFrame
Columns: [Name, Telugu, Maths, English, Total, College, Course]
Index: []

In [145]:
pd.merge(df,sf,on='Name',how='left') # getting df dataset.

      Name  Telugu  Maths  English  Total College Course
0  narmada      23     57       35    115     NaN    NaN
1   sumana      45     78       90    213     NaN    NaN
2   nethra     100     45       78    223     NaN    NaN

In [146]:
pd.merge(df,sf,on='Name',how='right') # getting sf dataset

        Name  Telugu  Maths  English  Total College            Course
0  'narmada'     NaN    NaN      NaN    NaN    IIIT  Machine Learning
1  'krishna'     NaN    NaN      NaN    NaN     SVU                 C
2   'nethra'     NaN    NaN      NaN    NaN    SRIT            Python
3     'mani'     NaN    NaN      NaN    NaN    PVKK      Data Science
4   'ganesh'     NaN    NaN      NaN    NaN    IIIT      Data Science

### Boolean or Fancy Indexing

In [148]:
df

      Name  Telugu  Maths  English  Total
0  narmada      23     57       35    115
1   sumana      45     78       90    213
2   nethra     100     45       78    223

In [153]:
df[(df['Maths']>50) & (df['English']>40)]['Telugu']

1    45
Name: Telugu, dtype: int64

In [154]:
sf

        Name College            Course
0  'narmada'    IIIT  Machine Learning
1  'krishna'     SVU                 C
2   'nethra'    SRIT            Python
3     'mani'    PVKK      Data Science
4   'ganesh'    IIIT      Data Science

In [156]:
sf[sf['Course']=='Data Science']

       Name College        Course
3    'mani'    PVKK  Data Science
4  'ganesh'    IIIT  Data Science

### Sort

In [157]:
df.sort_values('Maths') # Ascending Order based on Maths marks

      Name  Telugu  Maths  English  Total
2   nethra     100     45       78    223
0  narmada      23     57       35    115
1   sumana      45     78       90    213

In [158]:
df.sort_values('Maths',ascending=False) #descending order based on Maths marks

      Name  Telugu  Maths  English  Total
1   sumana      45     78       90    213
0  narmada      23     57       35    115
2   nethra     100     45       78    223

In [159]:
df1

         Telugu  Maths  English
Name
narmada      23     57       35
sumana       45     78       90
nethra      100     45       78

In [160]:
df1.sort_index()

         Telugu  Maths  English
Name
narmada      23     57       35
nethra      100     45       78
sumana       45     78       90

In [161]:
df['Telugu'].fillna(df['Telugu'].mean())

0     23
1     45
2    100
Name: Telugu, dtype: int64

In [162]:
df

      Name  Telugu  Maths  English  Total
0  narmada      23     57       35    115
1   sumana      45     78       90    213
2   nethra     100     45       78    223

In [163]:
df.dropna()

      Name  Telugu  Maths  English  Total
0  narmada      23     57       35    115
1   sumana      45     78       90    213
2   nethra     100     45       78    223

In [164]:
df

      Name  Telugu  Maths  English  Total
0  narmada      23     57       35    115
1   sumana      45     78       90    213
2   nethra     100     45       78    223

In [165]:
df.dropna(axis=1) # delete the null values.

      Name  Telugu  Maths  English  Total
0  narmada      23     57       35    115
1   sumana      45     78       90    213
2   nethra     100     45       78    223

In [166]:
df.drop('English',axis=1)

      Name  Telugu  Maths  Total
0  narmada      23     57    115
1   sumana      45     78    213
2   nethra     100     45    223

In [168]:
df

      Name  Telugu  Maths  English  Total
0  narmada      23     57       35    115
1   sumana      45     78       90    213
2   nethra     100     45       78    223

In [169]:
df

      Name  Telugu  Maths  English  Total
0  narmada      23     57       35    115
1   sumana      45     78       90    213
2   nethra     100     45       78    223

In [170]:
df1

         Telugu  Maths  English
Name
narmada      23     57       35
sumana       45     78       90
nethra      100     45       78

In [171]:
df1.drop('sumana')

         Telugu  Maths  English
Name
narmada      23     57       35
nethra      100     45       78

In [172]:
df1

         Telugu  Maths  English
Name
narmada      23     57       35
sumana       45     78       90
nethra      100     45       78

In [173]:
final_df = pd.merge(df,sf,how='outer')

In [174]:
final_df

        Name  Telugu  Maths  English  Total College            Course
0    narmada    23.0   57.0     35.0  115.0     NaN               NaN
1     sumana    45.0   78.0     90.0  213.0     NaN               NaN
2     nethra   100.0   45.0     78.0  223.0     NaN               NaN
3  'narmada'     NaN    NaN      NaN    NaN    IIIT  Machine Learning
4  'krishna'     NaN    NaN      NaN    NaN     SVU                 C
5   'nethra'     NaN    NaN      NaN    NaN    SRIT            Python
6     'mani'     NaN    NaN      NaN    NaN    PVKK      Data Science
7   'ganesh'     NaN    NaN      NaN    NaN    IIIT      Data Science

In [178]:
final_df.isnull()

    Name  Telugu  Maths  English  Total  College  Course
0  False   False  False    False  False     True    True
1  False   False  False    False  False     True    True
2  False   False  False    False  False     True    True
3  False    True   True     True   True    False   False
4  False    True   True     True   True    False   False
5  False    True   True     True   True    False   False
6  False    True   True     True   True    False   False
7  False    True   True     True   True    False   False

In [180]:
final_df.isnull().sum() # column wise Nan values.

Name       0
Telugu     5
Maths      5
English    5
Total      5
College    3
Course     3
dtype: int64

In [181]:
final_df.columns

Index(['Name', 'Telugu', 'Maths', 'English', 'Total', 'College', 'Course'], dtype='object')

In [182]:
final_df.dtypes

Name        object
Telugu     float64
Maths      float64
English    float64
Total      float64
College     object
Course      object
dtype: object

In [183]:
final_df.dtypes !=object

Name       False
Telugu      True
Maths       True
English     True
Total       True
College    False
Course     False
dtype: bool

In [184]:
final_df.columns[final_df.dtypes !=object]

Index(['Telugu', 'Maths', 'English', 'Total'], dtype='object')

In [187]:
final_df.describe().columns

Index(['Telugu', 'Maths', 'English', 'Total'], dtype='object')

In [188]:
final_df.columns[final_df.dtypes==object]

Index(['Name', 'College', 'Course'], dtype='object')

In [189]:
final_df

        Name  Telugu  Maths  English  Total College            Course
0    narmada    23.0   57.0     35.0  115.0     NaN               NaN
1     sumana    45.0   78.0     90.0  213.0     NaN               NaN
2     nethra   100.0   45.0     78.0  223.0     NaN               NaN
3  'narmada'     NaN    NaN      NaN    NaN    IIIT  Machine Learning
4  'krishna'     NaN    NaN      NaN    NaN     SVU                 C
5   'nethra'     NaN    NaN      NaN    NaN    SRIT            Python
6     'mani'     NaN    NaN      NaN    NaN    PVKK      Data Science
7   'ganesh'     NaN    NaN      NaN    NaN    IIIT      Data Science

### Numerical Columns

In [193]:
final_df['Maths'].fillna(final_df['Maths'].mean(),inplace=True)
final_df['Telugu'].fillna(final_df['Telugu'].mean(),inplace=True)
final_df['English'].fillna(final_df['English'].mean(),inplace=True)

In [208]:
final_df

        Name  Telugu  Maths    English  Total College            Course
0    narmada    23.0   57.0  35.000000  115.0    IIIT               NaN
1     sumana    45.0   78.0  90.000000  213.0    IIIT               NaN
2     nethra   100.0   45.0  78.000000  223.0    IIIT               NaN
3  'narmada'    56.0   60.0  67.666667    NaN    IIIT  Machine Learning
4  'krishna'    56.0   60.0  67.666667    NaN     SVU                 C
5   'nethra'    56.0   60.0  67.666667    NaN    SRIT            Python
6     'mani'    56.0   60.0  67.666667    NaN    PVKK      Data Science
7   'ganesh'    56.0   60.0  67.666667    NaN    IIIT      Data Science

In [197]:
cat_cols=final_df.describe(include=object).columns
num_cols=final_df.columns[final_df.dtypes !=object]

In [198]:
print(cat_cols)
print(num_cols)

Index(['Name', 'College', 'Course'], dtype='object')
Index(['Telugu', 'Maths', 'English', 'Total'], dtype='object')

In [200]:
print(final_df.College.mode())

0    IIIT
dtype: object

In [201]:
type(final_df)

pandas.core.frame.DataFrame

In [206]:
final_df['College'][final_df['College'].isna()]= final_df['College'].mode()[0]

C:\Users\IIIT-rgukt\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [205]:
final_df['College'].mode()[0]

'IIIT'

In [207]:
final_df

        Name  Telugu  Maths    English  Total College            Course
0    narmada    23.0   57.0  35.000000  115.0    IIIT               NaN
1     sumana    45.0   78.0  90.000000  213.0    IIIT               NaN
2     nethra   100.0   45.0  78.000000  223.0    IIIT               NaN
3  'narmada'    56.0   60.0  67.666667    NaN    IIIT  Machine Learning
4  'krishna'    56.0   60.0  67.666667    NaN     SVU                 C
5   'nethra'    56.0   60.0  67.666667    NaN    SRIT            Python
6     'mani'    56.0   60.0  67.666667    NaN    PVKK      Data Science
7   'ganesh'    56.0   60.0  67.666667    NaN    IIIT      Data Science

In [209]:
for col in cat_cols:
    final_df[col].fillna(final_df['College'].mode()[0],inplace=True)

In [210]:
final_df

        Name  Telugu  Maths    English  Total College            Course
0    narmada    23.0   57.0  35.000000  115.0    IIIT              IIIT
1     sumana    45.0   78.0  90.000000  213.0    IIIT              IIIT
2     nethra   100.0   45.0  78.000000  223.0    IIIT              IIIT
3  'narmada'    56.0   60.0  67.666667    NaN    IIIT  Machine Learning
4  'krishna'    56.0   60.0  67.666667    NaN     SVU                 C
5   'nethra'    56.0   60.0  67.666667    NaN    SRIT            Python
6     'mani'    56.0   60.0  67.666667    NaN    PVKK      Data Science
7   'ganesh'    56.0   60.0  67.666667    NaN    IIIT      Data Science

### Grouping

In [222]:
final_df.groupby('College')['Maths'].max()

College
IIIT    78.0
PVKK    60.0
SRIT    60.0
SVU     60.0
Name: Maths, dtype: float64

In [223]:
final_df.groupby('College').Maths.sum()

College
IIIT    300.0
PVKK     60.0
SRIT     60.0
SVU      60.0
Name: Maths, dtype: float64

In [224]:
final_df.groupby('College').sum()

         Telugu  Maths     English  Total
College
IIIT      280.0  300.0  338.333333  551.0
PVKK       56.0   60.0   67.666667    0.0
SRIT       56.0   60.0   67.666667    0.0
SVU        56.0   60.0   67.666667    0.0

In [227]:
final_df.groupby('College')[['Maths',"Telugu"]].max()

         Maths  Telugu
College
IIIT      78.0   100.0
PVKK      60.0    56.0
SRIT      60.0    56.0
SVU       60.0    56.0

### tasks

In [248]:
s1='Mahesh'
# haMesh
i,j=map(int,input().split())
s2=""
s2=s1[:i] #M
print(s2)
s3=s1[j-1] #h
print(s3)
print(s3+s1[1]+s2+s1[3:])

1 3
M
h
haMesh

In [246]:
s2 = s1[:3]
s2[::-1]+s1[3:]

'haMesh'